{
    "Front-End Development": "HTML pages was my first experience when I needed to dive into some kind of code, even some basic one.\nIt was a school project in Informatics, where we had to create our own webpages about our selected countries enitrely in HTML.\nAfter that I participated in some courses that taught me some basic HTML, CSS and JavaScript combo.\nIn the end, self-education became important thing in my life and now I am capable of using React framework, SASS preprocessor for CSS and many more.\nEven this portfolio is created with this tech!",
    "App and Back-End Development": "My next huge deep dive was creating actual applications that could have been used in some positive or useful way. I started with C# in another course that taught me how to write code, theory of OOP (Object-Oriented Programming) and work in a team. When I went to RTU I got my hands on other techs such as Java, C++ and etc. Of course, I didn't become profficient in every tech I learned, but much such as SQL, Python and some PHP did come in handy. Many applications and even functional full-stack websites got created!",
    "Unity Game Development": "Each kid in my childhood wanted to create his own videogame with all interesting mechanics inspired by other games. I weren't an exception. During Summer 2023 I decided to learn Unity and how it works and I think I did great, if my knowledge was necessary to create a game in a group during one of the courses at the university. Game was completed with all necessary requirements, collisions and overall good design. Pretty proud of it along with my student-colleagues.",
    "Blender Modelling": "Even though I wasn't very creative to come up with original ideas in my mind for 3D models, I am very good at inspecting sketches, ideas and then creating one of my kind. This way I create models in Blender. If I have some excellent references and a bunch of free time - I can create models that I won't be ashamed of! Anyway, in my plans, I would like to try use Blender for animations, because I had a big experience with SFM (Source Filmmaker) and Autodesk Maya 3D.",
    "Editing": "My first interest and my beloved one - editing. Something that started as a hobby and is helping me out even today. I love creating images and videos that other people can see, use, laugh with and overall will react. This way I prefer making some memes via Adobe Photoshop and creating videos of our friends goofing around, no matter if it happens in games or real life!"
}