{
    "Front-End Development": "HTML pages was my first experience when I needed to dive into some kind of code, even some basic one.\nIt was a school project in Informatics, where we had to create our own webpages about our selected countries entirely in HTML.\nAfter that I participated in some courses that taught me some basic Front-End (HTML, CSS, JavaScript combo).\nIn the end, self-education came around and now I am capable of using React framework, SASS preprocessor for CSS, overall learning useful and more comfortable tools.\n Fun fact: this portfolio is created with everything I learned so far!",
    "App and Back-End Development": "My actual deep dive in the field of programming was creating actual applications that could have been used in some positive or useful way. I started with C# in another course that taught me how to write code, theory of OOP (Object-Oriented Programming) and how to work in a team. When I went to RTU I got my hands on other programming languages such as Java, C++ and others (if you know, you know). Of course, I didn't become profficient in every programming language I got taught and learned myself, but languages such as SQL, Python and some PHP did come in handy. It can be seen on my GitHub.",
    "Unity Game Development": "Each kid I knew during my childhood wanted to create his own videogame with all mechanics he saw and got inspired from other games. I weren't an exception. During Summer 2023 I decided to learn Unity and how it works and I did great, because my knowledge was necessary to create a game in a group during one of the courses at the university. Game was completed with all necessary requirements, collisions and overall good design. Pretty proud of it along with my student-colleagues that I keep in touch nowadays.",
    "Blender Modelling": "Honestly, I am not very creative person. During art lessons I prefered to draw existing art with my own hands so I can learn from it and be motivated to finish it. This way I create models in Blender. It is a good practice and I really recommend everyone to try it atleast once. I don't see it as copying, because I am not straight-forward tracing it or creating every minor detail in the original, I derive from it to try create something that I can call 'mine'. Anyway, in my plans, I would like to try use Blender for animations, because I had a big experience with SFM (Source Filmmaker) in my teens and learned Autodesk Maya 3D at the university.",
    "Editing": "My first interest and my beloved one - editing. Something that started as a hobby and is helping me out even today. I love creating images and videos that other people can see, use, laugh with and overall will react in some positive way. I prefer making some memes via Adobe Photoshop and creating videos of my friends and me goofing around, no matter if it happens in games or real life. It is a good relieve, when times get rough and it results in something that I can come back to and remember all the good times I had."
}